bench/results/java21/20260425T110111Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 300, "warmup_s": 120, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 6680.93, "p50": "3.44ms", "p95": "5.72ms", "p99": "6.59ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 5m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.58ms    0.98ms  18.04ms   71.72%\n    Req/Sec     1.68k   125.07     1.92k    74.12%\n  Latency Distribution\n     50%    3.44ms\n     75%    4.11ms\n     90%    4.85ms\n     99%    6.59ms\n  2004926 requests in 5.00m, 456.98MB read\nRequests/sec:   6680.93\nTransfer/sec:      1.52MB"}